Tekla.Structures.Drawing.Events
The Events class allows the user to register event listeners for drawing events.
Remarks:
Asynchronous event handling
Registered event handlers are called asynchronously so that many handlers may be running
simultaneously. Event handlers are not guaranteed to be run in the same thread where they were registered.
The asynchronous nature of the events requires the use of synchronization constructs on objects
and data structures that are not defined to be thread safe.
Microsoft's documentation about the lock statement: http://msdn.microsoft.com/en-us/library/c5kehkcz.aspx
Microsoft's documentation about delegates: http://msdn.microsoft.com/en-us/library/900fyy8e.aspx
Microsoft's documentation about managed threading: http://msdn.microsoft.com/en-us/library/1c9txz50.aspx
The following example shows how to make sure that only one selection event handler is running at a time.
using Tekla.Structures.Drawing;
public class Example
{
private Events _events = new Events();
private object _statusChangedEventHandlerLock = new object();
public void RegisterEventHandler()
{
_events.DrawingStatusChanged += Events_DrawingStatusChangedEvent;
_events.Register();
}
public void UnRegisterEventHandler()
{
_events.UnRegister();
}
void Events_DrawingStatusChangedEvent()
{
/* Make sure that the inner code block is running synchronously */
lock(_statusChangedEventHandlerLock)
{
System.Console.WriteLine("Selection changed event received.");
}
}
}

Tekla.Structures.Drawing.Events.DrawingInserted
The DrawingInserted event is raised when a drawing has been inserted.

Tekla.Structures.Drawing.Events.DrawingDeleted
The DrawingDeleted event is raised when a drawing has been deleted.

Tekla.Structures.Drawing.Events.DrawingStatusChanged
The DrawingStatusChanged event is raised when the drawing status has changed.

Tekla.Structures.Drawing.Events.DrawingChanged
The DrawingChanged event is raised when the drawing has been changed and the database is committed.

Tekla.Structures.Drawing.Events.DrawingUpdated
The DrawingUpdated event is raised when the drawing has been inserted, deleted or modified, and the database is committed.

Tekla.Structures.Drawing.Events.DrawingReadyForIssuingChange
The DrawingReadyForIssuingChange event is raised just after a drawing is marked or unmarked ready for issuing.

Tekla.Structures.Drawing.Events.HasDrawingUpdatedListeners


Tekla.Structures.Drawing.Events.OnDrawingInserted(System.String,System.Object[])


Tekla.Structures.Drawing.Events.OnDrawingDeleted(System.String,System.Object[])


Tekla.Structures.Drawing.Events.OnDrawingStatusChanged(System.String,System.Object[])


Tekla.Structures.Drawing.Events.OnDrawingChanged(System.String,System.Object[])


Tekla.Structures.Drawing.Events.OnDrawingUpdated(System.String,System.Object[])


Tekla.Structures.Drawing.Events.OnDrawingReadyForIssuingChange(System.String,System.Boolean)


Tekla.Structures.Drawing.Events.InitializeLifetimeService
Initializes the lifetime service.
Returns: Always null.

Tekla.Structures.Drawing.Events.#ctor
Constructs a new instance of Events.

Tekla.Structures.Drawing.Events.Register
Registers the instance to listen to the specified events.
Throws System.InvalidOperationException: Thrown if attempting registration when already registered.

Tekla.Structures.Drawing.Events.UnRegister
Unregisters the instance from listening to events.

Tekla.Structures.Drawing.Events.Dispose
Disposes of the Events instance.

Tekla.Structures.Drawing.Events.Finalize
Finalizes the Events instance.